Revit 2027 API
BuiltInFailures.RebarFailures.ClearPresentationForAllBarsInRebarSet Property
 All Bars in a Free Form Rebar Set have been hidden.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ClearPresentationForAllBarsInRebarSet { get; }
Public Shared ReadOnly Property ClearPresentationForAllBarsInRebarSet As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ClearPresentationForAllBarsInRebarSet {
	FailureDefinitionId^ get ();
}
static member ClearPresentationForAllBarsInRebarSet : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace